heshanpasindusankalpa/STM32H7/Robot_Controller/drivers/Src/stm32h743vit6_gpio_drivers.c
/*
 * stm32h743vit6_gpio_driver.c
 *
 *  Created on: Mar 2, 2026
 *      Author: ASUS
 */

#include "stm32h743vit6_gpio_drivers.h"

//Peripheral clock setup
/****************************************************************
 * @fn        -GPIO_PeriClockControl
 *
 * @brief     -This function enables or disables peripheral clock for given GPIO port
 *
 * @param[in] -base address of the GPIO Peripheral
 * @param[in] -ENABLE or DISABLE macros
 * @param[in] -
 *
 * @return    -none
 *
 * @Note      -none
 */
void GPIO_PeriClockControl(GPIO_RegDef_t *pGPIOx,uint8_t EnorDi)
{
	if(EnorDi==ENABLE)
	{
		if(pGPIOx == GPIOA)
		{
			GPIOA_PCLK_EN();

		}else if(pGPIOx==GPIOB)
		{
			GPIOB_PCLK_EN();
		}else if(pGPIOx==GPIOC)
		{
			GPIOC_PCLK_EN();
		}else if(pGPIOx==GPIOD)
		{
			GPIOD_PCLK_EN();
		}else if(pGPIOx==GPIOE)
		{
			GPIOE_PCLK_EN();
		}else if(pGPIOx==GPIOF)
		{
			GPIOF_PCLK_EN();
		}else if(pGPIOx==GPIOG)
		{
			GPIOG_PCLK_EN();
		}else if(pGPIOx==GPIOH)
		{
			GPIOH_PCLK_EN();
		}else if(pGPIOx==GPIOI)
		{
			GPIOI_PCLK_EN();
		}

	}
	else
	{
		if(pGPIOx==GPIOA)
		{
			GPIOA_PCLK_DI();

		}else if(pGPIOx==GPIOB)
		{
			GPIOB_PCLK_DI();
		}else if(pGPIOx==GPIOC)
		{
			GPIOC_PCLK_DI();
		}else if(pGPIOx==GPIOD)
		{
			GPIOD_PCLK_DI();
		}else if(pGPIOx==GPIOE)
		{
		    GPIOE_PCLK_DI();
		}else if(pGPIOx==GPIOF)
		{
			GPIOF_PCLK_DI();
		}else if(pGPIOx==GPIOG)
		{
			GPIOG_PCLK_DI();
		}else if(pGPIOx==GPIOH)
		{
			GPIOH_PCLK_DI();
		}else if(pGPIOx==GPIOI)
		{
			GPIOI_PCLK_DI();
		}

	}

}

void GPIO_Init(GPIO_Handle_t *pGPIOHandle)
{
	uint32_t temp=0;

	//1.CONGIGURE THE MODE OF GPIO P
	if(pGPIOHandle->GPIO_PinConfig.GPIO_PinMode<=GPIO_MODE_ANALOG)
	{
		//the non interrupt mode
		temp=pGPIOHandle->GPIO_PinConfig.GPIO_PinMode<<(2 *pGPIOHandle->GPIO_PinConfig.GPIO_PinNumber);
		pGPIOHandle->pGPIOx->MODER &=~(0x3<<(2*pGPIOHandle->GPIO_PinConfig.GPIO_PinNumber));//clearing
		pGPIOHandle->pGPIOx->MODER|=temp;

	}else
	{

	}
	temp=0;
	//2.configure the speed
	temp=pGPIOHandle->GPIO_PinConfig.GPIO_PinSpeed<<(2*pGPIOHandle->GPIO_PinConfig.GPIO_PinNumber);
	pGPIOHandle->pGPIOx->OSPEEDR &=~(0x3<<(2*pGPIOHandle->GPIO_PinConfig.GPIO_PinNumber));//clearing
	pGPIOHandle->pGPIOx->OSPEEDR|=temp;


	temp=0;
	//3.configure the pipd setting
	temp=pGPIOHandle->GPIO_PinConfig.GPIO_PinPulPdControl<<(2*pGPIOHandle->GPIO_PinConfig.GPIO_PinNumber);
	pGPIOHandle->pGPIOx->PUPDR &=~(0x3<<(2*pGPIOHandle->GPIO_PinConfig.GPIO_PinNumber));//clearing
	pGPIOHandle->pGPIOx->PUPDR|=temp;


    temp=0;
	//4.configure the optype
	temp=(pGPIOHandle->GPIO_PinConfig.GPIO_PinOPType<<pGPIOHandle->GPIO_PinConfig.GPIO_PinNumber);
	pGPIOHandle->pGPIOx->OTYPER &=~(0x1<<pGPIOHandle->GPIO_PinConfig.GPIO_PinNumber);//clearing
	pGPIOHandle->pGPIOx->OTYPER|=temp;

	//5.configure the alt functionality

     if(pGPIOHandle->GPIO_PinConfig.GPIO_PinMode==GPIO_MODE_ALTFN)
     {
    	 uint8_t temp1,temp2;
    	 temp1=pGPIOHandle->GPIO_PinConfig.GPIO_PinNumber/8;
    	 temp2=pGPIOHandle->GPIO_PinConfig.GPIO_PinNumber%8;
    	 pGPIOHandle->pGPIOx->AFR[temp1] &=~(0XF<<(4*temp2));
    	 pGPIOHandle->pGPIOx->AFR[temp1] |=(pGPIOHandle->GPIO_PinConfig.GPIO_PinAltFunMode<<(4*temp2));

     }

}
void GPIO_DeInit(GPIO_RegDef_t *pGPIOx)
{
	if(pGPIOx==GPIOA)
			{
				GPIOA_REG_RESET();

			}else if(pGPIOx==GPIOB)
			{
				GPIOB_REG_RESET();
			}else if(pGPIOx==GPIOC)
			{
				GPIOC_REG_RESET();
			}else if(pGPIOx==GPIOD)
			{
				GPIOD_REG_RESET();
			}else if(pGPIOx==GPIOE)
			{
				GPIOE_REG_RESET();
			}else if(pGPIOx==GPIOF)
			{
				GPIOF_REG_RESET();
			}else if(pGPIOx==GPIOG)
			{
				GPIOG_REG_RESET();
			}else if(pGPIOx==GPIOH)
			{
				GPIOH_REG_RESET();
			}else if(pGPIOx==GPIOI)
			{
				GPIOI_REG_RESET();
			}


}
uint8_t GPIO_ReadFromInputPin(GPIO_RegDef_t *pGPIOx,uint8_t PinNumber)
{
	uint8_t value;
	value=(uint8_t)((pGPIOx->IDR>>PinNumber)& 0x00000001);
	return value;

}
uint16_t GPIO_ReadFromInputPort(GPIO_RegDef_t *pGPIOx)
{
	uint16_t value;
	value=(uint16_t)pGPIOx->IDR;
	return value;


}
void GPIO_WriteToOutputPin(GPIO_RegDef_t *pGPIOx,uint8_t PinNumber,uint8_t Value)
{
	if(Value ==GPIO_PIN_SET)
	{
		//write 1 to the output data reg at the bit field correcsponding pin num
		pGPIOx->ODR |=(1<<PinNumber);

	}else
	{
		//write 0
		pGPIOx->ODR &=~(1<<PinNumber);
	}

}
void GPIO_WriteToOutputPort(GPIO_RegDef_t *pGPIOx,uint8_t Value){
	pGPIOx->ODR=Value;

}
void GPIO_ToggleOutputPin(GPIO_RegDef_t *pGPIOx,uint8_t PinNumber)
{
	pGPIOx->ODR ^=(1<<PinNumber);

}

void GPIO_IRQConfig(uint8_t TRQNumber,uint8_t IRQPriority,uint8_t EnorDi)
{

}
void GPIO_IRQHandling(uint8_t PinNumber)
{

}
